In [1]:
%run "../LOS.ipynb"

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
df = dreams_mastersheet

# La cohort des beneficaires

In [5]:
base = df[+
    (df.age_range!="not_valid_age")
    &(df.age_range!="25-29")
    &(df.timeOn_system=="required_Time_on")
]
base.code.count()

18839

In [6]:
base.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           903     796     650     268           5046         7663
15-19           978     672     357     154           5210         7371
20-24           513     326     152      61           2753         3805
Grand Total    2394    1794    1159     483          13009        18839

# curriculum

In [7]:
curriculum_complet = base[
    (base.dreams_curriculum=="curriculum_completed")
]
curriculum_complet.code.count()

15679

In [10]:
curriculum_complet.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           716     605     526     166           4311         6324
15-19           779     498     300     115           4448         6140
20-24           399     257     111      45           2403         3215
Grand Total    1894    1360     937     326          11162        15679

# Condoms

In [12]:
condoms = base[
    (base.condoms=="tested_on_given_date")
]

condoms.code.count()

new_condoms = base[
    (base.new_condoms=="sensOuRecu")
]

new_condoms.code.count()

3209

3445

In [13]:
condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            82     101      42      24            223          472
15-19           301     170     109      53            970         1603
20-24           236      89      49      22            738         1134
Grand Total     619     360     200      99           1931         3209

In [14]:
new_condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            82     106      83      45            239          555
15-19           315     202     131      55           1005         1708
20-24           247     112      54      22            747         1182
Grand Total     644     420     268     122           1991         3445

# depistage VIH

In [17]:
vih = base[
    (base.hts=="tested_on_given_date")
]
vih.code.count()

1953

In [18]:
vih.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            33      10      21       1            388          453
15-19            80      25      26       4            646          781
20-24           153      24      31       6            505          719
Grand Total     266      59      78      11           1539         1953

# Post Care Treatment

In [21]:
post_violence_care = base[
    (base.post_care_treatment=="service_gyneco_vbg")
]
post_violence_care.code.count()

86

In [22]:
post_violence_care.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  Q3fy20-Q4fy20  Grand Total
age_range
10-14             3       0             16           19
15-19             3       1             36           40
20-24             0       0             27           27
Grand Total       6       1             79           86

# socio economique Approche

In [20]:
Combin_socio_eco =  base[
    (base.socio_eco_app=="service_muso_gardening")
]

Combin_socio_eco.code.count()

377

In [24]:
Combin_socio_eco.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  Q3fy20-Q4fy20  Grand Total
age_range
10-14                  125          125
15-19                  134          134
20-24                  118          118
Grand Total            377          377

# PREP

In [25]:
prep = base[
    (base.init_prep=="tested_on_given_date")
]
prep.code.count()

34

In [27]:
prep.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0              4            4
15-19             4       0             10           14
20-24             6       2              8           16
Grand Total      10       2             22           34

# Primary Services

In [29]:
ps14 = base[
    (base.ps_10_14=="curriculum-servis")
]
ps14.code.count()

ps19 = base[
    (base.ps_15_19=="condoms&curriculum")
]
ps19.code.count()

ps24 = base[
    (base.ps_20_24=="condoms&curriculum")
]
ps24.code.count()

6324

1511

1058

In [30]:
ps14.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           716     605     526     166           4311         6324
Grand Total     716     605     526     166           4311         6324

In [31]:
ps19.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
15-19           289     161     124      25            912         1511
Grand Total     289     161     124      25            912         1511

In [32]:
ps24.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
20-24           221      92      40       8            697         1058
Grand Total     221      92      40       8            697         1058